Language/NCE3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>NCE3</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="NCE3"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-03-21T11:44+0800"/>
<meta name="author" content="ChrisChen"/>
<meta name="description" content=""/>
<meta name="keywords" content="NCE"/>
<link rel="stylesheet" href="../css/stylesheet.css" type="text/css"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:100%;white-space:nowrap;">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>


<div id="content">
<h1 class="title">NCE3</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 A puma at large</a></li>
<li><a href="#sec-2">2 Thirteen equals one</a></li>
<li><a href="#sec-3">3 A unknown goddess</a></li>
<li><a href="#sec-4">4 The double life of Alfred Bloggs</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> A puma at large</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> words</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4"></span> leopard [lepəd]</h4>
<div class="outline-text-4" id="text-1-1-1">


<p class="verse">
a large animal of the cat family, with yellow fur and black spots, which lives in Africa and South Asia<br/>
一般豹统一称为leopard<br/>
</p>


<ul>
<li id="sec-1-1-1-1">puma<br/>
a large American wild animal of the cat family, with yellowish-brown or greyish fur
</li>
</ul>
<ul>
<li id="sec-1-1-1-2">jaguar<br/>
a large cat (Panthera onca) chiefly of Central and South America that is larger and stockier than the leopard and is brownish yellow or buff with black spots
</li>
</ul>
</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4"></span> possession</h4>
<div class="outline-text-4" id="text-1-1-2">

<ul>
<li id="sec-1-1-2-1">in sb's possession<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-2-2">in the possession of something<br/>
</li>
</ul>
<ul>
<li id="sec-1-1-2-3">take possession of something<br/>
start having or using it
</li>
</ul>
</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4"></span> oblige</h4>
<div class="outline-text-4" id="text-1-1-3">

<p>feel obliged to = be obliged to
</p></div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> notes</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4"></span> at large</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>free of restraint or confinement
</p></div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4"></span> on a fishing trip</h4>
<div class="outline-text-4" id="text-1-2-2">


<p class="verse">
on + n. 强调动作正在进行<br/>
on the rise<br/>
on the match<br/>
</p>


</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4"></span> take sth. seriously</h4>
<div class="outline-text-4" id="text-1-2-3">

</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Thirteen equals one</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> words</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4"></span> arm</h4>
<div class="outline-text-4" id="text-2-1-1">

<ul>
<li>to provide all the information, skills, or equipment you need to do something
</li>
<li>arm sb. with sth.(sb. be armed with sth.) →equip sb. with sth.
</li>
</ul>

</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4"></span> grocer</h4>
<div class="outline-text-4" id="text-2-1-2">

<p>someone who owns or works in a shop that sells food and other things used in the home
</p></div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4"></span> equal</h4>
<div class="outline-text-4" id="text-2-1-3">

<ul>
<li id="sec-2-1-3-1">be equal to sth.<br/>

<p class="verse">
to have the ability to deal with a problem, piece of work etc successfully<br/>
= be up to<br/>
</p>


</li>
</ul>
</div>

</div>

<div id="outline-container-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4"></span> start</h4>
<div class="outline-text-4" id="text-2-1-4">


<p class="verse">
a sudden movement of your body, usually caused by fear or surprise<br/>
eg: Ted woke up with a start and felt for the light switch.<br/>
</p>


</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> notes</h3>
<div class="outline-text-3" id="text-2-2">


</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4"></span> catch sight of</h4>
<div class="outline-text-4" id="text-2-2-1">

<p>瞥见
</p></div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4"></span> get used to doing sth./sth.</h4>
<div class="outline-text-4" id="text-2-2-2">

<p>i.e
</p><ul>
<li id="sec-2-2-2-1">be used to<br/>
</li>
</ul>
<ul>
<li id="sec-2-2-2-2">be accustomed to<br/>
</li>
</ul>
<ul>
<li id="sec-2-2-2-3">get accustomed to<br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4"></span> ever since</h4>
<div class="outline-text-4" id="text-2-2-3">

<p>continuously since the time mentioned
</p></div>

</div>

<div id="outline-container-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4"></span> Whatever are you doing</h4>
<div class="outline-text-4" id="text-2-2-4">

<p>Whatever 加强语气： 你究竟在干什么？
</p></div>

</div>

<div id="outline-container-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4"></span> Still,</h4>
<div class="outline-text-4" id="text-2-2-5">

<p>Still 用于句首，表转折。
</p></div>

</div>

<div id="outline-container-2-2-6" class="outline-4">
<h4 id="sec-2-2-6"><span class="section-number-4"></span> in 特殊用法(in the torchlight)</h4>
<div class="outline-text-4" id="text-2-2-6">

<ul>
<li id="sec-2-2-6-1">used with negatives or with ‘first’ to say how much time has passed since the last time something happened<br/>
eg: It was the team’s first win in eighteen months.
</li>
</ul>
<ul>
<li id="sec-2-2-6-2">wearing something<br/>
eg: He looked very handsome in his uniform.
</li>
</ul>
<ul>
<li id="sec-2-2-6-3">used to talk about the state or situation of something or someone<br/>
eg: I hear that their marriage is in trouble.
</li>
</ul>
<ul>
<li id="sec-2-2-6-4">used to talk about the shape, arrangement, or course of something or someone<br/>

<p class="verse">
eg: She slept curled up in a ball.  <br/>
Can you walk in a straight line?<br/>
</p>


</li>
</ul>
<ul>
<li id="sec-2-2-6-5">used to say how something is done or happens<br/>

<p class="verse">
eg:a short note scribbled in pencil<br/>
Her parents always talk to her in German.<br/>
She shouted my name in a harsh voice.<br/>
</p>


</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> A unknown goddess</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> words</h3>
<div class="outline-text-3" id="text-3-1">


</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4"></span> archaeologist</h4>
<div class="outline-text-4" id="text-3-1-1">

<p>考古学家
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Anthropologist</td><td class="left">人类学家</td></tr>
<tr><td class="left">Philosopher</td><td class="left">哲学家</td></tr>
<tr><td class="left">Geologist</td><td class="left">地质学家</td></tr>
<tr><td class="left">Psychologist</td><td class="left">心理学家</td></tr>
<tr><td class="left">Biologist</td><td class="left">生物学家</td></tr>
<tr><td class="left">Physicist</td><td class="left">物理学家</td></tr>
<tr><td class="left">Chemist</td><td class="left">化学家</td></tr>
<tr><td class="left">Economist</td><td class="left">经济学家</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4"></span> promontory [ˈprɒməntəri]</h4>
<div class="outline-text-4" id="text-3-1-2">

<p>a long narrow piece of land which sticks out into the sea
</p></div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4"></span> prosperous adj.</h4>
<div class="outline-text-4" id="text-3-1-3">

<p>rich and successful
</p></div>

</div>

<div id="outline-container-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4"></span> sacred [ˈseɪkrəd] adj.</h4>
<div class="outline-text-4" id="text-3-1-4">

<p>relating to a god or religion →holy
</p></div>

</div>

<div id="outline-container-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4"></span> classical vs. classic</h4>
<div class="outline-text-4" id="text-3-1-5">

</div>

</div>

<div id="outline-container-3-1-6" class="outline-4">
<h4 id="sec-3-1-6"><span class="section-number-4"></span> rest on/upon sth.</h4>
<div class="outline-text-4" id="text-3-1-6">

<ul>
<li>to depend on something
</li>
</ul>


<p>
eg: Success in management ultimately rests on good judgment.
</p></div>

</div>

<div id="outline-container-3-1-7" class="outline-4">
<h4 id="sec-3-1-7"><span class="section-number-4"></span> graceful</h4>
<div class="outline-text-4" id="text-3-1-7">


<p class="verse">
behaving in a polite and pleasant way<br/>
→elegant 优雅 可表达graceful类似的意思<br/>
an idea or a plan that is elegant is very intelligent yet simple:<br/>
</p>


</div>

</div>

<div id="outline-container-3-1-8" class="outline-4">
<h4 id="sec-3-1-8"><span class="section-number-4"></span> reconstruct</h4>
<div class="outline-text-4" id="text-3-1-8">

<ul>
<li>construct
</li>
<li>constructive
</li>
<li>construction
</li>
</ul>

</div>

</div>

<div id="outline-container-3-1-9" class="outline-4">
<h4 id="sec-3-1-9"><span class="section-number-4"></span> enjoy</h4>
<div class="outline-text-4" id="text-3-1-9">

<ul>
<li>to have a particular ability or advantage
</li>
</ul>


<p>
eg: These workers enjoy a high level of job security.
</p></div>

</div>

<div id="outline-container-3-1-10" class="outline-4">
<h4 id="sec-3-1-10"><span class="section-number-4"></span> beneath [bɪˈniːθ]</h4>
<div class="outline-text-4" id="text-3-1-10">

<p>in or to a lower position than something, or directly under something
</p></div>

</div>

<div id="outline-container-3-1-11" class="outline-4">
<h4 id="sec-3-1-11"><span class="section-number-4"></span> statue</h4>
<div class="outline-text-4" id="text-3-1-11">

<p>an image of a person or animal that is made in solid material such as stone or metal and is usually large → sculpture
</p></div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> notes</h3>
<div class="outline-text-3" id="text-3-2">


</div>

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4"></span> for 状语从句</h4>
<div class="outline-text-4" id="text-3-2-1">

<ul>
<li>重点是对主句的附加说明和解释。because引导的突出原因。
</li>
</ul>


<p>
eg: The day broke for the birds were singing.
</p></div>

</div>

<div id="outline-container-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4"></span> happen to</h4>
<div class="outline-text-4" id="text-3-2-2">

<ul>
<li>to occur by chance — often used with it
</li>
</ul>


<p>
eg: It happened to be among remains.
</p></div>

</div>

<div id="outline-container-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4"></span> turn out</h4>
<div class="outline-text-4" id="text-3-2-3">

<ul>
<li>to happen in a particular way, or to have a particular result, especially one that you did <b>not expect</b>
</li>
</ul>


<p class="verse">
eg: It was a difficult time, but eventually things turned out all right.<br/>
That guy turned out to be Maria’s second cousin.<br/>
<b>As it turned out</b> (=used to say what happened in the end), he passed the exam quite easily.<br/>
</p>


<ul>
<li>despite
</li>
</ul>

<p>→ in spite of
</p></div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> The double life of Alfred Bloggs</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> words</h3>
<div class="outline-text-3" id="text-4-1">


</div>

<div id="outline-container-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4"></span> manual</h4>
<div class="outline-text-4" id="text-4-1-1">


<p class="verse">
manual worker = blue collar<br/>
pink collar(female blue collar)<br/>
</p>


</div>

</div>

<div id="outline-container-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4"></span> sacrifice</h4>
<div class="outline-text-4" id="text-4-1-2">

<ul>
<li>v.
</li>
</ul>


<p class="verse">
sacrifice A to/for B<br/>
sacrifice A to do B<br/>
</p>


<ul>
<li>n.
</li>
</ul>

<p>make some sacrifice
</p></div>

</div>

<div id="outline-container-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4"></span> privilege</h4>
<div class="outline-text-4" id="text-4-1-3">

<p>特权优待 
a special advantage that is given only to one person or group of people
eg: Parking on this road is the privilege of the residents.
</p></div>

</div>

<div id="outline-container-4-1-4" class="outline-4">
<h4 id="sec-4-1-4"><span class="section-number-4"></span> shower</h4>
<div class="outline-text-4" id="text-4-1-4">

<p>淋浴
</p><ul>
<li>bath 盆浴
</li>
</ul>

<p>take a shower/bath
</p>
<p class="verse">
bath-tub 浴缸<br/>
run a bath 放洗澡水<br/>
</p>


</div>

</div>

<div id="outline-container-4-1-5" class="outline-4">
<h4 id="sec-4-1-5"><span class="section-number-4"></span> secret |siːkrɪt|</h4>
<div class="outline-text-4" id="text-4-1-5">

<ul>
<li id="sec-4-1-5-1">保密说法<br/>
<ul>
<li>keep a secret
</li>
<li>hold one's tongue about
</li>
<li>button up one's lip
</li>
<li>This is only between you and me
</li>
<li>This can never go out of this room
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-4-1-5-2">泄密说法<br/>
<ul>
<li>reveal the secret
</li>
<li>let the secret out
</li>
<li>let the cat out of the bag
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-4-1-5-3">词组<br/>
do sth. in secret 偷偷做某事
</li>
</ul>
<ul>
<li id="sec-4-1-5-4">adj.<br/>
keep &hellip; secret from  sb.

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> notes</h3>
<div class="outline-text-3" id="text-4-2">


</div>

<div id="outline-container-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4"></span> these days</h4>
<div class="outline-text-4" id="text-4-2-1">

<p>= nowadays = presently = currently = for the time being
</p></div>

</div>

<div id="outline-container-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4"></span> give rise to</h4>
<div class="outline-text-4" id="text-4-2-2">

<p>导致
</p></div>

</div>

<div id="outline-container-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4"></span> worth</h4>
<div class="outline-text-4" id="text-4-2-3">

<ul>
<li>be worth + money
</li>
<li>be worth doing
</li>
</ul>


</div>
</div>
</div>
</div>
</div>

</body>
</html>
